Revit 2026 API

# RebarContainerCreate Method

---

Creates a new instance of a Rebar Container element within the project.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static RebarContainer Create(
	Document aDoc,
	Element hostElement,
	ElementId rebarContainerTypeId
)
```
```vb
Public Shared Function Create (
	aDoc As Document,
	hostElement As Element,
	rebarContainerTypeId As ElementId
) As RebarContainer
```
```cpp
public:
static RebarContainer^ Create(
	Document^ aDoc,
	Element^ hostElement,
	ElementId^ rebarContainerTypeId
)
```
```fsharp
static member Create :
        aDoc : Document *
        hostElement : Element *
        rebarContainerTypeId : ElementId -> RebarContainer
```

#### Parameters

aDoc Document
     A document.
hostElement Element
     The element that will host the RebarContainer.
rebarContainerTypeId ElementId
     The id of the RebarContainerType.

#### Return Value

RebarContainer The newly created Rebar Container instance.

| Exception | Condition |
| --- | --- |
| ArgumentException | The element hostElement was not found in the given document. -or- hostElement is not a valid rebar host. -or- the ElementId rebarContainerTypeId is either invalid or not a RebarContainerType. |
| ArgumentNullException | A non-optional argument was null |

Created Rebar Container starts out empty. Use appendItemFromRebar, appendItemFromCurves, appendItemFromRebarShape, appendItemFromCurvesAndShape to fill its content.

#### Reference

RebarContainer Class

Autodesk.Revit.DB.Structure Namespace